tutorials/adaptiveHeater/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    // leftSolid
    {
        name    leftSolid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 -100 )(0 100 100);
        }
    }
    {
        name    leftSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set leftSolid;
        }
    }

    // rightSolid
    {
        name    rightSolid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 -100 -100 )(100 100 100);
        }
    }
    {
        name    rightSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rightSolid;
        }
    }
);

// ************************************************************************* //
